[
  {
    "id": "1758364879244",
    "title": "Data analytics",
    "text": "Sony Vakode\n+91 8639423882 sonyvakode648@gmail.com https://linkedin.com/in/sonyvakode Hyderabad\nOBJECTIVE\nDynamic Computer Science Engineering student with a solid foundation in Architecture and a\nstrong passion for software development. Proficient in Python and Streamlit, with a commitment\nto creating practical, user-friendly tools leveraging emerging technologies.\nWORK EXPERIENCE\nTechLead Intern JUN-2025\nVISWAM.AI\n• Built and deployed Streamlit-based applications for collecting and managing multilingual Indian\nlanguage datasets.\n• Designed features such as daily streaks, leaderboards, and community voting to increase user\nparticipation.\n• Implemented translation support and audio/text input options to make the app more accessible.\n• Organized and maintained structured datasets (JSON, pipelines) for cultural and linguistic\nprojects.\n• Contributed to creating lightweight applications optimized for use in low-internet regions.\nArchitect AUG-2023\nRound Square\n• Assisted in preparing architectural drawings, layouts, and 3D models for residential and\ncommercial projects.\n• Conducted site visits and surveys to document existing conditions and support project planning.\n• Collaborated with senior architects on design concepts, space planning, and material selection.\n• Prepared presentations and reports to communicate design ideas to clients and teams.\n• Gained hands-on exposure to design software, construction workflows, and project\ncoordination.`\nEDUCATION\nKamala Nehru Polytechnic College for Women\n2020-08 - 2023-05\nMethodist College of Engineering and Technology\n2023-08 - 2027-05\nSri Vidya High School\n2020-03\nPROJECT\nBuilding OpenSource AI Assistants - Link Summer-2025\n• Developed an interactive chatbot application using Streamlit, enhancing how students access\ncampus services and information.\n• Integrated advanced AI models, Gemini 2.0 Flash and Ollama, to deliver context-aware and\naccurate responses to user inquiries.\n• Created a modular architecture for efficient project management, allowing for scalable features\nand easy deployment on Streamlit Cloud.\nIndian Wisdom: Proverbs Collector - Link JULY-2024\n• Compiled a comprehensive collection of over 300 traditional Indian proverbs, highlighting\ncultural wisdom and values.\n• Categorized proverbs into themes such as love, wisdom, and morality to enhance accessibility\nand relevance for diverse audiences.\n• Conducted interviews with elders and community leaders to ensure accurate representation and\nunderstanding of the proverbs' meanings.\nSKILLS\n• Proficient in AutoCAD for creating detailed technical drawings and blueprints.\n• Experienced in utilizing GitHub for version control and collaborative software development.\n• Skilled in front-end technologies including HTML, CSS, and JavaScript for responsive web\ndesign.",
    "created_at": 1758364879.2445185
  }
]